// 강남대학교 학과 데이터 구조
export const COLLEGE_DATA = {
  자유전공학부: { 자유전공학부: ['자유전공학부'] },
  복지융합대학: {
    사회복지학부: ['사회복지학전공', '사회서비스학전공', '노인복지전공'],
    '사회복지학부(야)': ['사회복지학전공(야)'],
    시니어비즈니스학과: ['시니어비즈니스학과'],
  },
  경영관리대학: {
    상경학부: ['경영학전공', '경제금융학전공', '국제무역학전공'],
    '상경학부(야)': ['경영학전공(야)', '경제금융학전공(야)'],
    법행정세무학부: ['세무학전공', '법행정학전공'],
  },
  글로벌문화콘텐츠대학: {
    문화콘텐츠학과: ['문화콘텐츠학과'],
    국제지역학과: ['국제지역학과'],
    중국콘텐츠비즈니스학과: ['중국콘텐츠비즈니스학과'],
    한국어문학과: ['한국어문학과'],
  },
  공과대학: {
    컴퓨터공학부: ['소프트웨어전공', '메타버스게임전공'],
    인공지능융합공학부: ['인공지능전공', '데이터사이언스전공'],
    전자반도체공학부: ['전자공학전공', '반도체공학전공', '스마트모빌리티전공'],
    부동산건설학부: ['부동산학전공', '스마트도시공학전공', '건축공학전공'],
  },
  예체능대학: {
    디자인학과: ['디자인학과'],
    체육학과: ['체육학과'],
    음악학과: ['음악학과'],
  },
  사범대학: {
    교육학과: ['교육학과'],
    유아교육과: ['유아교육과'],
    초등특수교육과: ['초등특수교육과'],
    중등특수교육과: ['중등특수교육과'],
  },
}

export const GRADES = [1, 2, 3, 4]
export const SEMESTERS = [1, 2]
